Revit 2025 API
ElectricalLoadClassificationSpace Enumeration
 This enum is used by the ElectricalLoadClassification to specify the load class for use with spaces.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalLoadClassificationSpace
Public Enumeration ElectricalLoadClassificationSpace
public enum class ElectricalLoadClassificationSpace
type ElectricalLoadClassificationSpace
Members
Member name | Value | Description
None | 0
Lighting | 1
Power | 2
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace